# Hej

Denne notebook indeholder alt! Alle de store bruger denne notebook

# TODO
- Import af excel data, formater, kode område navne til ting "man forstår
- Tilføj række om industri eller konsum
- Tilføj række med priser de enkelte år
- Cirkel diagrammer af hvad vi fanger total og i alle farvande (PLOT ALLE CIRKLER PÅ EN GANG)
- Index kurver og total fangst (DROPDOWN MENUER)
- Vækstrate beregninger

# Indlæs Data

In [11]:
#First we import relevant packages needed downlaod and open the zipfile
import zipfile
import urllib.request
import shutil
import pandas as pd

#URL (wepbage) and file_name specifies
url = 'http://www.ices.dk/marine-data/Documents/CatchStats/OfficialNominalCatches.zip'
file_name = 'OfficialNominalCatches.zip'

#We "call" the zip-filee from the url by using urllib.request
with urllib.request.urlopen(url) as response, open(file_name, 'wb') as out_file:
    shutil.copyfileobj(response, out_file)
    with zipfile.ZipFile(file_name) as zf:
        zf.extractall()

In [12]:
# Read data from file 'filename.csv' 
# (in the same directory that your python process is based)
# Control delimiters, rows, column names with read_csv (see later) 
data = pd.read_csv("ICESCatchDataset2006-2016.csv") 

# Preview the first 5 lines of the loaded data 
data.head()

,Species,Area,Units,Country,2016,2015,2014,2013,2012,2011,...,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,ANF,27.4,TLW,BE,253.3,200.3,216.9,136.8,132.8,116.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ANF,27.7,TLW,BE,963.4,722.8,491.1,1123.8,1381.5,966.1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ANF,27.8,TLW,BE,216.0,181.0,285.4,372.5,201.2,196.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANF,27,TLW,BE,1432.7,1104.1,993.4,1633.1,1715.5,1278.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ANF,27.4.a,TLW,BE,0.0,0.0,0.0,0.1,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
#rename columns to avoid having only numbers
yearDict = {}
for i in range(2006, 2017): # range goes from 2006 to but not including 2017
    yearDict[str(i)] = f'y{i}' 

data.rename(columns = yearDict, inplace=True)
data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,...,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26
0,ANF,27.4,TLW,BE,253.3,200.3,216.9,136.8,132.8,116.4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,ANF,27.7,TLW,BE,963.4,722.8,491.1,1123.8,1381.5,966.1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,ANF,27.8,TLW,BE,216.0,181.0,285.4,372.5,201.2,196.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,ANF,27,TLW,BE,1432.7,1104.1,993.4,1633.1,1715.5,1278.5,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,ANF,27.4.a,TLW,BE,0.0,0.0,0.0,0.1,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
#Drop columns if all values are NaN
data.dropna(axis="columns", how="all", inplace=True)
data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
0,ANF,27.4,TLW,BE,253.3,200.3,216.9,136.8,132.8,116.4,131.2,139.6,184.9,181.3,141.1
1,ANF,27.7,TLW,BE,963.4,722.8,491.1,1123.8,1381.5,966.1,720.5,518.2,584.7,1039.5,907.0
2,ANF,27.8,TLW,BE,216.0,181.0,285.4,372.5,201.2,196.0,179.3,195.1,194.3,142.4,144.4
3,ANF,27,TLW,BE,1432.7,1104.1,993.4,1633.1,1715.5,1278.5,1031.0,852.9,963.9,1363.2,1192.5
4,ANF,27.4.a,TLW,BE,0.0,0.0,0.0,0.1,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [15]:
#Drop if countries is different from Denmark
data = data[data['Country']=='DK']

data.head(10)

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3876,AAS,27.3,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,AAS,27,TLW,DK,0.03,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,AAS,27.3.a,TLW,DK,0.00,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,27.3.c.22,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,27.4,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,AAS,27.4.b,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,ABK,27.4,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3883,ABK,27,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3884,ABK,27.4.b,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3885,AFT,27.4,TLW,DK,0.00,2.35,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Renaming of fish species

In [16]:
data.loc[data['Species'] == 'BLL', ['Species']] = 'Slethvar'
data.loc[data['Species'] == 'BOR', ['Species']] = 'Havgalt'
data.loc[data['Species'] == 'CAP', ['Species']] = 'Lodde'
data.loc[data['Species'] == 'CAT', ['Species']] = 'Havkat'
data.loc[data['Species'] == 'COD', ['Species']] = 'Torsk'
data.loc[data['Species'] == 'CSH', ['Species']] = 'Hestereje'
data.loc[data['Species'] == 'DAB', ['Species']] = 'Ising'
data.loc[data['Species'] == 'ELE', ['Species']] = 'Blanke/gule ål'
data.loc[data['Species'] == 'FLE', ['Species']] = 'Skrubbe'
data.loc[data['Species'] == 'HAD', ['Species']] = 'Kuller'
data.loc[data['Species'] == 'HER', ['Species']] = 'Sild'
data.loc[data['Species'] == 'HKE', ['Species']] = 'Kulmule'
data.loc[data['Species'] == 'HOM', ['Species']] = 'Hestemakrel'
data.loc[data['Species'] == 'LBE', ['Species']] = 'Alm. hummer'
data.loc[data['Species'] == 'LEM', ['Species']] = 'Rødtunge'
data.loc[data['Species'] == 'LIN', ['Species']] = 'Lange'
data.loc[data['Species'] == 'LUM', ['Species']] = 'Kulso/stenbider'
data.loc[data['Species'] == 'MAC', ['Species']] = 'Makrel'
data.loc[data['Species'] == 'MON', ['Species']] = 'Havtaske'
data.loc[data['Species'] == 'MUS', ['Species']] = 'Blåmusling'
data.loc[data['Species'] == 'NEP', ['Species']] = 'Dybvandhummer'
data.loc[data['Species'] == 'OYF', ['Species']] = 'Østers'
data.loc[data['Species'] == 'PLE', ['Species']] = 'Rødspætte'
data.loc[data['Species'] == 'POK', ['Species']] = 'Mørksej'
data.loc[data['Species'] == 'POL', ['Species']] = 'Lyssej'
data.loc[data['Species'] == 'PRA', ['Species']] = 'Dybvandsrejer'
data.loc[data['Species'] == 'SAL', ['Species']] = 'Laks'
data.loc[data['Species'] == 'SAN', ['Species']] = 'Tobis'
data.loc[data['Species'] == 'SOL', ['Species']] = 'Tunge'
data.loc[data['Species'] == 'SPR', ['Species']] = 'Brisling'
data.loc[data['Species'] == 'TRS', ['Species']] = 'Havørred'
data.loc[data['Species'] == 'TUR', ['Species']] = 'Pighvar'
data.loc[data['Species'] == 'WHB', ['Species']] = 'Blåhvilling'
data.loc[data['Species'] == 'WHG', ['Species']] = 'Hvilling'
data.loc[data['Species'] == 'WIT', ['Species']] = 'Skærising'

data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3876,AAS,27.3,TLW,DK,0.00,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3877,AAS,27,TLW,DK,0.03,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3878,AAS,27.3.a,TLW,DK,0.00,0.0,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,27.3.c.22,TLW,DK,0.00,0.0,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,27.4,TLW,DK,0.03,0.0,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Dropping of Irrelevant areas

In [17]:
data = data.loc[(data['Area'] == '27.4') | (data['Area'] == '27.3.c.22') | (data['Area'] == '27.3.a.20') |(data['Area'] == '27.3.a.21') | (data['Area'] == '27.3.b') | (data['Area'] == '27.3.d') | (data['Area'] == '27') ]  

data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3877,AAS,27,TLW,DK,0.03,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,27.3.c.22,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,27.4,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,ABK,27.4,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3883,ABK,27,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

## Renaming of areas and dropping irrelevant areas

In [18]:
data.loc[data['Area'] == '27.4', ['Area']] = 'North Sea'
data.loc[data['Area'] == '27.3.c.22', ['Area']] = 'Belt Sea'
data.loc[data['Area'] == '27.3.a.20', ['Area']] = 'Skagerrak'
data.loc[data['Area'] == '27.3.a.21', ['Area']] = 'Kattegat'
data.loc[data['Area'] == '27.3.b', ['Area']] = 'Sound'
data.loc[data['Area'] == '27.3.d', ['Area']] = 'Baltic Sea'
data.loc[data['Area'] == '27', ['Area']] = 'All seas'

data.head()

,Species,Area,Units,Country,y2016,y2015,y2014,y2013,y2012,y2011,y2010,y2009,y2008,y2007,y2006
3877,AAS,All seas,TLW,DK,0.03,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,AAS,Belt Sea,TLW,DK,0.00,0.00,0.0,0.23,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,AAS,North Sea,TLW,DK,0.03,0.00,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,ABK,North Sea,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3883,ABK,All seas,TLW,DK,0.03,0.06,0.0,0.00,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [20]:
print(data)

          Species        Area Units Country     y2016     y2015     y2014  \
3877          AAS    All seas   TLW      DK      0.03      0.00      0.00
3879          AAS    Belt Sea   TLW      DK      0.00      0.00      0.00
3880          AAS   North Sea   TLW      DK      0.03      0.00      0.00
3882          ABK   North Sea   TLW      DK      0.03      0.06      0.00
3883          ABK    All seas   TLW      DK      0.03      0.06      0.00
3885          AFT   North Sea   TLW      DK      0.00      2.35      0.00
3886          AFT    All seas   TLW      DK      0.00      2.35      0.00
3890          ANE   North Sea   TLW      DK     86.98   5640.33      0.00
3892          ANE    All seas   TLW      DK    139.29   5716.97     53.12
3894          ANE   Skagerrak   TLW      DK      5.51      0.00      0.00
3895          ANE    Kattegat   TLW      DK     45.41      0.00      0.00
3897          ANE    Belt Sea   TLW      DK      1.39      0.88      0.00
3898          ANE  Baltic Sea   TLW      DK      0.00      6.93      0.00
3910          ARG   North Sea   TLW      DK     54.61      0.00      0.00
3911          ARG    All seas   TLW      DK     54.61      0.00      0.00
3918          ARU   North Sea   TLW      DK     88.57     58.47     40.26
3920          ARU    All seas   TLW      DK     88.80     58.47    751.18
3929          BFT   North Sea   TLW      DK      0.00      0.00      0.00
3931          BFT    All seas   TLW      DK      0.00      0.00      0.00
3935          BFT    Belt Sea   TLW      DK      0.00      0.00      0.00
3941          BIB   North Sea   TLW      DK      4.99      0.03      4.50
3942          BIB    All seas   TLW      DK      4.99      0.03      4.50
3946          BIB    Belt Sea   TLW      DK      0.00      0.00      0.00
3952          BLE    All seas   TLW      DK      0.00      0.15      0.70
3956          BLE    Belt Sea   TLW      DK      0.00      0.09      0.37
3957          BLE  Baltic Sea   TLW      DK      0.00      0.01      0.13
3960          BLF    All seas   TLW      DK      0.00      0.00      0.00
3964          BLI   North Sea   TLW      DK      0.48      0.70      0.12
3965          BLI    All seas   TLW      DK      0.63      0.84      0.22
3972     Slethvar   North Sea   TLW      DK    131.32    122.02     96.41
...           ...         ...   ...     ...       ...       ...       ...
6269          URS    All seas   TLW      DK     43.03      0.00      0.04
6275          URX   North Sea   TLW      DK      0.00      0.00      0.00
6276          URX    All seas   TLW      DK      0.00      0.00      0.00
6282          USB    All seas   TLW      DK      0.00      0.08      0.03
6288          USK   North Sea   TLW      DK     33.43     27.16     23.05
6291          USK    All seas   TLW      DK     34.41     27.99     24.25
6301          USK    Belt Sea   TLW      DK      0.00      0.00      0.00
6302          USK  Baltic Sea   TLW      DK      0.00      0.00      0.00
6316          VSP   North Sea   TLW      DK      0.00      0.00      0.00
6317          VSP    All seas   TLW      DK      0.00      0.00      0.00
6320          WEG   North Sea   TLW      DK      6.75      4.48      0.80
6321          WEG    All seas   TLW      DK   1250.75   1249.58   1225.76
6327          WEG    Belt Sea   TLW      DK      0.02      0.02      0.02
6328          WEG  Baltic Sea   TLW      DK      0.00      0.00      0.00
6337  Blåhvilling   North Sea   TLW      DK     42.78     41.74   1070.26
6341  Blåhvilling    All seas   TLW      DK  39134.45  45098.92  35011.22
6353  Blåhvilling    Belt Sea   TLW      DK      0.00      0.00      0.00
6354  Blåhvilling  Baltic Sea   TLW      DK      0.00      0.00      0.00
6382          WHE   North Sea   TLW      DK     46.39      0.16      0.01
6383          WHE    All seas   TLW      DK     85.08      0.16      0.01
6393     Hvilling   North Sea   TLW      DK   4726.54   2374.76    160.34
6397     Hvilling    All seas   TLW      DK   5351.61   3253.01    393.95
6408     Hvilling    Belt Sea   TLW      DK     24.86     45.23      2.84
6409     Hvilling  Baltic Sea   TLW      DK    131.28    184.05    181.01
6429          WHX   North Sea   TLW      DK      0.00      0.00      0.00
6430          WHX    All seas   TLW      DK      0.00      0.00      0.00
6437    Skærising   North Sea   TLW      DK    534.19    291.38    237.21
6442    Skærising    All seas   TLW      DK   1523.47   1234.14   1512.66
6451    Skærising    Belt Sea   TLW      DK      0.09      0.03      0.04
6452    Skærising  Baltic Sea   TLW      DK      0.00      0.00      0.00

        y2013    y2012   y2011   y2010   y2009     y2008     y2007     y2006
3877     0.23     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3879     0.23     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3880     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3882     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3883     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3885     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3886     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3890     0.00     0.00    0.00    0.00    0.00      0.00      0.00     74.00
3892     0.00     0.00    0.00   20.20    0.00      0.00    156.00    158.00
3894     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3895     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3897     0.00     0.00    0.00   20.20    0.00      0.00    156.00     84.00
3898     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3910     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3911     0.00     0.00    0.00    0.01    0.01      0.01      0.00      0.00
3918   271.29     0.00    0.00    0.00    0.00      0.00      0.00     11.00
3920   396.12     0.00    0.00    0.00    0.00      0.00      0.00    335.00
3929     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3931     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3935     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3941     0.03     0.01    0.20    0.01    0.02      0.01      0.03      0.03
3942     0.03     0.01    0.22    0.02    0.03      0.01      0.04      0.04
3946     0.00     0.00    0.00    0.01    0.00      0.00      0.00      0.00
3952     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3956     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3957     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3960     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
3964     0.21     0.22    0.40    0.51    1.21      2.01      5.01      6.01
3965     0.40     0.38    1.36    0.52    1.22      2.02      5.02     48.01
3972   122.94   126.25  121.98   97.40   96.40     86.00     52.00     75.00
...       ...      ...     ...     ...     ...       ...       ...       ...
6269     0.37     0.02    0.00    0.02    0.02      0.02      0.02      0.02
6275     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
6276     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
6282     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
6288    44.61    29.69   53.62   36.40   49.30     57.01     96.00    157.01
6291    45.42    30.46   54.90   37.51   50.51     57.02     97.02    161.02
6301     0.00     0.00    0.00    0.01    0.00      0.00      0.01      0.00
6302     0.00     0.00    0.00    0.00    0.01      0.00      0.00      0.01
6316     0.00     0.00    0.00    0.00    0.00      0.00      0.00      6.00
6317     0.00     0.00    0.00    0.00    0.00      0.00      0.00      6.00
6320     1.39     0.89    0.53    0.81    0.71      0.01      0.02      1.00
6321   909.61   279.12  425.90   46.13   38.03     41.01    378.03   1722.01
6327     0.08     0.04    0.08    0.01    0.01      1.00      1.00     14.00
6328     0.00     0.00    0.00    0.00    0.00      0.00      0.00      0.00
6337   108.24   180.20  108.54  112.01  109.50    346.00   6539.00   4209.00
6341  2026.29   279.41  137.06  141.71  246.80  17998.00  52654.00  58184.00
6353     0.00     0.08    0.00    0.00    0.00      0.00      0.00      0.00
6354     0.00     0.00    0.00    0.00    0.00      0.00    275.00      3.00
6382     0.13     0.00    0.00    0.01    0.01      0.01      0.01      1.00
6383     0.13     0.00    0.00    0.01    0.01      0.01      0.01     33.00
6393   124.14   130.99  134.67  157.70   79.20     42.00     78.01    251.00
6397   327.23   264.21  327.69  511.62  326.70    341.00    576.02    763.02
6408     4.92     1.42   19.58  194.60   40.70    135.00    317.00    382.00
6409   168.80   101.82  132.57  118.61  133.60    106.00    122.01     68.02
6429     0.00     0.00    0.00    0.00    0.00      0.00      0.00      2.00
6430     0.00     0.00    0.00    0.00    0.00      0.00      0.00      2.02
6437   251.80   246.28  244.77  250.71  349.70    351.00    531.00    654.01
6442  1054.79  1167.10  810.20  787.53  942.72    827.04   1149.05   1290.04
6451     0.02     0.02    0.05    0.01    0.01      0.01      0.01      1.00
6452     0.00     0.01    0.00    0.00    0.00      0.02      0.02      0.02

[496 rows x 15 columns]